logs/preview-html-externo.org

#+TITLE: Preview html desde otro dispositivo
#+DATE: [2021-08-05 vie]

#+SETUPFILE: ~/.emacs.d/template/html.org
#+EXPORT_FILE_NAME: ../tmp/preview-html-externo.org

* Como crear un servidor de prueba 
python3 viene con un servidor http para hacer pruebas en localhost, así puedes probar tus paginas sin el problema de que no carguen los recursos nuevos. Para inicializarlo solo navegamos hasta el directorio en el que se encuentre nuestro dispositivo y escribimos el siguiente comando en la terminal, ojo que yo estoy trabajando desde linux:

#+BEGIN_SRC
  python3 -m http.server 8080
#+END_SRC

* Preview en otro dispositivo
Ahora nuestro dispositivo esta compartiendo nuestra pagina por el puerto 8080, para acceder a nuestra pagina necesitamos el ip de nuestro dispositivo (ó también aparece con el nombre ipv4), explora el apartado de wifi y debería aparecer, sí estas en Linux, ú otro sistema operativo Unix like, una forma mas rápida de obtenerlo es con el siguiente comando:

#+BEGIN_SRC 
  ifconfig | grep -Eo 'inet (addr:)?([0-9]*\.){3}[0-9]*' | grep -Eo '([0-9]*\.){3}[0-9]*' | grep -v '127.0.0.1'
#+END_SRC

#+RESULTS:
: 192.168.1.70

ese numero es la "url" a nuestro dispositivo (ojo que es solo en la red local, ambos dispositivos tienen que estar conectados a la misma red para que nuestra pagina sea visible en ambos dispositivos), como la dirección de nuestra pagina web, solo tenemos que especificar el nombre de nuestro archivo al final del la url, así se debería ver http://192.168.1.70:8080/index.html, y eso es todo, podemos tener la cantidad de dispositivos que queramos esto es muy útil para probar como se controla una pagina web adaptativa, por ultimo dejo un script para automatizar este proceso:

#+BEGIN_SRC 
  nombre="calculadora.html"
  port=8080
  printf "http://$( ifconfig | grep -Eo 'inet (addr:)?([0-9]*\.){3}[0-9]*' | grep -Eo '([0-9]*\.){3}[0-9]*' | grep -v '127.0.0.1' ):%d/%s" $port $nombre
  python3 -m http.server 8080
#+END_SRC

#+RESULTS:
: http://192.168.1.70:8080/index.html
